Show / Hide Table of Contents
Class GrpcServiceBasedReflectionClient<IReflectionService>
WCF-like implementation of the GrpcReflectionClient that uses interceptors to proxy calls to server.
Inheritance
System.Object
GrpcReflectionClient
GrpcServiceBasedReflectionClient<IReflectionService>
Inherited Members
 GrpcReflectionClient.IsConnected
 GrpcReflectionClient.ConnectAsync()
 GrpcReflectionClient.DisconnectAsync()
 GrpcReflectionClient.InvokeMethod<T>(String, Object[])
 GrpcReflectionClient.InvokeMethod(Type, String, Object[])
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin.Grpc.Reflection
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public class GrpcServiceBasedReflectionClient<IReflectionService> : GrpcReflectionClient where IReflectionService : class
Type Parameters
 Name |  Description
 IReflectionService
Constructors
Improve this Doc   View Source
GrpcServiceBasedReflectionClient(String, Int32)
Declaration
public GrpcServiceBasedReflectionClient(string clientId, int port)
Parameters
 Type |  Name |  Description
 System.String |  clientId
 System.Int32 |  port
Properties
Improve this Doc   View Source
Service
Service used to call server methods.
Declaration
public IReflectionService Service { get; }
Property Value
 Type |  Description
 IReflectionService
 Improve this Doc
 View Source